// Даден е масив, който съдържа информация за български владетели, и периода на тяхното управление.
// Всеки елемент на масива е масив със следните данни:
// 	[<име>, <начална година на управление>, <крайна година на управление>]

// do not modify! - func
function toCamelCaseCyr(str) {
    return str.toLowerCase()
        .replace(/(?:\b|^|[^а-яА-Я])([а-яА-Я])/g, (all, chr) => chr.toUpperCase());
}

var rulers = [
    ["асПАРуХ", 681, 700],
    ["тЕРвеЛ", 700, 718],
    ["СеВаР", 738, 753],
    ["телЕРИГ", 766, 777],
    ["каРДАм", 777, 803],
    ["крум", 803, 814],
    ["ОмурТАг", 814, 831],
];

// ЗАДАЧА: Изпишете в конзолата имената на онези български владетели, които са управлявали повече от 15 години.
// Разбира се, искаме да видим имената изписани според конвенциите за имена на съществителни-собствени: за целта може да използвате върху всяко име функцията toCamelCaseCyr(), която връща подадения й низ в скобите конвертиран до CamelCase

// >>>>>>>>>>НАЧАЛО НА ВАШИЯ КОД >>>>>>>>>>

for (let i = 0; i < rulers.length; i++) {
    if(rulers[i][2]-rulers[i][1]>15){
        rulName = rulers[i][0];
        console.log(toCamelCaseCyr(rulName));
    };
};

// <<<<<<<<<< КРАЙ НА ВАШИЯ КОД <<<<<<<<<<<<<